# SetLayoutAsFixedNumber Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainerItem..::..SetLayoutAsFixedNumber Method
RebarContainerItem Class See Also
---
Sets the Layout Rule property of rebar set to FixedNumber.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void SetLayoutAsFixedNumber(
	int numberOfBarPositions,
	double arrayLength,
	bool barsOnNormalSide,
	bool includeFirstBar,
	bool includeLastBar
)
```

Visual Basic
---
```text
Public Sub SetLayoutAsFixedNumber ( _
	numberOfBarPositions As Integer, _
	arrayLength As Double, _
	barsOnNormalSide As Boolean, _
	includeFirstBar As Boolean, _
	includeLastBar As Boolean _
)
```

Visual C++
---
```text
public:
void SetLayoutAsFixedNumber(
	int numberOfBarPositions,
	double arrayLength,
	bool barsOnNormalSide,
	bool includeFirstBar,
	bool includeLastBar
)
```

# ### Parameters
numberOfBarPositions
    Type: System..::..Int32 The number of bar positions in rebar set
arrayLength
    Type: System..::..Double The distribution length of rebar set
barsOnNormalSide
    Type: System..::..Boolean Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar
    Type: System..::..Boolean Identifies if the first bar in rebar set is shown
includeLastBar
    Type: System..::..Boolean Identifies if the last bar in rebar set is shown
# Remarks
When changing the layout rule to FixedNumber, you must also simultaneously set NumberOfBarPositions, SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | the number of bar positions numberOfBarPositions is less than 1 or more than 1002. -or- the set length arrayLength isn't acceptable. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | This RebarContainerItem is an instance of a spiral or multiplanar shape. |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace